Revit 2027 API
AutomaticConnectionBehaviorType Enumeration
 Defines behavior of connector with respect to automatic creation of connections
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AutomaticConnectionBehaviorType
Public Enumeration AutomaticConnectionBehaviorType
public enum class AutomaticConnectionBehaviorType
type AutomaticConnectionBehaviorType
Members
Member name | Value | Description
Accepting | 3 |  Connector accepts more automatic connections if needed, but
Active | 1 |  Connector is actively looking to be connected
Exclude | 0 |  Connector does not participate in automatic connection
Forced | 2 |  Connector must establish a connection
Full | 4 |  Connector may participate in automatic connection, but at the moment it is fully connected
See Also
Reference
Autodesk.Revit.DB Namespace